; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v1 - type_3 ?v3 - type_1)
 	      (pred_3 ?v4 - object ?v3 - type_1)
	      (pred_2 ?v1 - type_3 ?v5 - type_2)
	      (pred_4 ?v1 - type_3 ?v4 - object ?v5 - type_2))

   (:action op_3
       :parameters  (?v1 - type_3 ?v7 ?v2 - type_1)
       :precondition (and  (pred_1 ?v1 ?v7))
       :effect (and  (pred_1 ?v1 ?v2)
		     (not (pred_1 ?v1 ?v7))))

   (:action op_2
       :parameters (?v1 - type_3 ?v8 - object ?v6 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v8 ?v6) (pred_1 ?v1 ?v6) (pred_2 ?v1 ?v5))
       :effect (and (pred_4 ?v1 ?v8 ?v5)
		    (not (pred_3 ?v8 ?v6)) 
		    (not (pred_2 ?v1 ?v5))))

   (:action op_1
       :parameters (?v1 - type_3 ?v8 - object ?v6 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v8 ?v5) (pred_1 ?v1 ?v6))
       :effect (and (pred_3 ?v8 ?v6)
		    (pred_2 ?v1 ?v5)
		    (not (pred_4 ?v1 ?v8 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_03 - type_3
obj_08 obj_02 obj_10 obj_14 - type_2
obj_12 obj_05 obj_07 obj_01 - type_1
obj_06 obj_09 obj_04 obj_13 - object)
(:init
(pred_1 obj_11 obj_07)
(pred_2 obj_11 obj_08)
(pred_2 obj_11 obj_02)
(pred_1 obj_03 obj_12)
(pred_2 obj_03 obj_10)
(pred_2 obj_03 obj_14)
(pred_3 obj_06 obj_12)
(pred_3 obj_09 obj_07)
(pred_3 obj_04 obj_01)
(pred_3 obj_13 obj_12)
)
(:goal
(and
(pred_3 obj_06 obj_05)
(pred_3 obj_09 obj_05)
(pred_3 obj_04 obj_05)
(pred_3 obj_13 obj_01)
)
)

(:constraints
  (always (not (pred_1 obj_11 obj_01)))
)
)

; plan
1. (op_2 obj_03 obj_13 obj_12 obj_14)
   deleted: (pred_3 obj_13 obj_12) (pred_2 obj_03 obj_14)
   added: (pred_4 obj_03 obj_13 obj_14)
   goals met: 0 of 4
2. (op_2 obj_03 obj_06 obj_12 obj_10)
   deleted: (pred_3 obj_06 obj_12) (pred_2 obj_03 obj_10)
   added: (pred_4 obj_03 obj_06 obj_10)
   goals met: 0 of 4
3. (op_2 obj_11 obj_09 obj_07 obj_02)
   deleted: (pred_3 obj_09 obj_07) (pred_2 obj_11 obj_02)
   added: (pred_4 obj_11 obj_09 obj_02)
   goals met: 0 of 4
4. (op_3 obj_03 obj_12 obj_01)
   deleted: (pred_1 obj_03 obj_12)
   added: (pred_1 obj_03 obj_01)
   goals met: 0 of 4
5. (op_3 obj_11 obj_07 obj_05)
   deleted: (pred_1 obj_11 obj_07)
   added: (pred_1 obj_11 obj_05)
   goals met: 0 of 4
6. (op_1 obj_03 obj_13 obj_01 obj_14)
   deleted: (pred_4 obj_03 obj_13 obj_14)
   added: (pred_3 obj_13 obj_01) (pred_2 obj_03 obj_14)
   goals met: 1 of 4
7. (op_1 obj_11 obj_09 obj_05 obj_02)
   deleted: (pred_4 obj_11 obj_09 obj_02)
   added: (pred_3 obj_09 obj_05) (pred_2 obj_11 obj_02)
   goals met: 2 of 4
8. (op_2 obj_03 obj_04 obj_01 obj_14)
   deleted: (pred_3 obj_04 obj_01) (pred_2 obj_03 obj_14)
   added: (pred_4 obj_03 obj_04 obj_14)
   goals met: 2 of 4
9. (op_3 obj_03 obj_01 obj_05)
   deleted: (pred_1 obj_03 obj_01)
   added: (pred_1 obj_03 obj_05)
   goals met: 2 of 4
10. (op_1 obj_03 obj_04 obj_05 obj_14)
   deleted: (pred_4 obj_03 obj_04 obj_14)
   added: (pred_3 obj_04 obj_05) (pred_2 obj_03 obj_14)
   goals met: 3 of 4
11. (op_1 obj_03 obj_06 obj_05 obj_10)
   deleted: (pred_4 obj_03 obj_06 obj_10)
   added: (pred_3 obj_06 obj_05) (pred_2 obj_03 obj_10)
   goals met: 4 of 4
